githubhjz/rt-thread/bsp/stm32f10xCUBE/drivers/usart.c
/*
 * File      : usart.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2006-2013, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 * 2010-03-29     Bernard      remove interrupt Tx and DMA Rx mode
 * 2013-05-13     aozima       update for kehong-lingtai.
 */

#include "stm32f1xx_hal.h"
#include "usart.h"
#include "board.h"

#include <rtdevice.h>

/* USART1 */
#define UART1_GPIO_TX		GPIO_Pin_9
#define UART1_GPIO_RX		GPIO_Pin_10
#define UART1_GPIO			GPIOA



/* STM32 uart driver */
struct stm32_uart
{
    USART_TypeDef* uart_device;
    IRQn_Type irq;
};

static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct stm32_uart* uart;
//    USART_InitTypeDef USART_InitStructure;

//    RT_ASSERT(serial != RT_NULL);
//    RT_ASSERT(cfg != RT_NULL);

//    uart = (struct stm32_uart *)serial->parent.user_data;

//    USART_InitStructure.USART_BaudRate = cfg->baud_rate;

//    if (cfg->data_bits == DATA_BITS_8)
//        USART_InitStructure.USART_WordLength = USART_WordLength_8b;

//    if (cfg->stop_bits == STOP_BITS_1)
//        USART_InitStructure.USART_StopBits = USART_StopBits_1;
//    else if (cfg->stop_bits == STOP_BITS_2)
//        USART_InitStructure.USART_StopBits = USART_StopBits_2;

//    USART_InitStructure.USART_Parity = USART_Parity_No;
//    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
//    USART_Init(uart->uart_device, &USART_InitStructure);

//    /* Enable USART */
//    USART_Cmd(uart->uart_device, ENABLE);
//    /* enable interrupt */
//    USART_ITConfig(uart->uart_device, USART_IT_RXNE, ENABLE);

    return RT_EOK;
}

static rt_err_t stm32_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct stm32_uart* uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct stm32_uart *)serial->parent.user_data;

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        UART_DISABLE_IRQ(uart->irq);
        break;
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        UART_ENABLE_IRQ(uart->irq);
        break;
    }

    return RT_EOK;
}

static int stm32_putc(struct rt_serial_device *serial, char c)
{
//    struct stm32_uart* uart;

//    RT_ASSERT(serial != RT_NULL);
//    uart = (struct stm32_uart *)serial->parent.user_data;

//    while (!(uart->uart_device->SR & USART_FLAG_TXE));
//    uart->uart_device->DR = c;

    return 1;
}

static int stm32_getc(struct rt_serial_device *serial)
{
    int ch;
//    struct stm32_uart* uart;

//    RT_ASSERT(serial != RT_NULL);
//    uart = (struct stm32_uart *)serial->parent.user_data;

//    ch = -1;
//    if (uart->uart_device->SR & USART_FLAG_RXNE)
//    {
//        ch = uart->uart_device->DR & 0xff;
//    }

    return ch;
}

static const struct rt_uart_ops stm32_uart_ops =
{
    stm32_configure,
    stm32_control,
    stm32_putc,
    stm32_getc,
};

#if defined(RT_USING_UART1)
/* UART1 device driver structure */
struct serial_ringbuffer uart1_int_rx;
struct stm32_uart uart1 =
{
    USART1,
    USART1_IRQn,
};
struct rt_serial_device serial1;

void USART1_IRQHandler(void)
{
    struct stm32_uart* uart;

    uart = &uart1;

    /* enter interrupt */
    rt_interrupt_enter();
//    if(USART_GetITStatus(uart->uart_device, USART_IT_RXNE) != RESET)
//    {
//        rt_hw_serial_isr(&serial1);
//        /* clear interrupt */
//        USART_ClearITPendingBit(uart->uart_device, USART_IT_RXNE);
//    }
//    if (USART_GetITStatus(uart->uart_device, USART_IT_TC) != RESET)
//    {
//        /* clear interrupt */
//        USART_ClearITPendingBit(uart->uart_device, USART_IT_TC);
//    }

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* RT_USING_UART1 */





static void RCC_Configuration(void)
{
//#ifdef RT_USING_UART1
//    /* Enable UART GPIO clocks */
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
//    /* Enable UART clock */
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
//#endif /* RT_USING_UART1 */
}

static void GPIO_Configuration(void)
{
//    GPIO_InitTypeDef GPIO_InitStructure;

//    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

//#ifdef RT_USING_UART1
//    /* Configure USART Rx/tx PIN */
//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
//    GPIO_InitStructure.GPIO_Pin = UART1_GPIO_RX;
//    GPIO_Init(UART1_GPIO, &GPIO_InitStructure);

//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//    GPIO_InitStructure.GPIO_Pin = UART1_GPIO_TX;
//    GPIO_Init(UART1_GPIO, &GPIO_InitStructure);
//#endif /* RT_USING_UART1 */

}

static void NVIC_Configuration(struct stm32_uart* uart)
{
//    NVIC_InitTypeDef NVIC_InitStructure;

//    /* Enable the USART1 Interrupt */
//    NVIC_InitStructure.NVIC_IRQChannel = uart->irq;
//    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
//    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//    NVIC_Init(&NVIC_InitStructure);
}

void rt_hw_usart_init(void)
{
    struct stm32_uart* uart;
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    RCC_Configuration();
    GPIO_Configuration();

#ifdef RT_USING_UART1
    uart = &uart1;
    config.baud_rate = BAUD_RATE_115200;

    serial1.ops    = &stm32_uart_ops;
    serial1.int_rx = &uart1_int_rx;
    serial1.config = config;

    NVIC_Configuration(&uart1);

    /* register UART1 device */
    rt_hw_serial_register(&serial1, "uart1",
                          RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX | RT_DEVICE_FLAG_STREAM,
                          uart);
#endif /* RT_USING_UART1 */

}
